{
  "status": "SUCCESS",
  "message": "Inference Done",
  "type": "LLAMA",
  "timestamp": "Fri Jan 16 08:14:47 PM UTC 2026",
  "data": {
    "response": "I'm happy to help with a stress test. Here are some questions to help me simulate a variety of scenarios:\n\n**Question 1:** Imagine you're working on a team project, and one of your teammates is consistently not contributing or following through on their commitments. What would be the most effective way to address this issue?\n\nA) Have a calm conversation with the teammate\nB) Send a strongly worded email to the teammate's manager\nC) Ignore the issue and hope it resolves itself\nD) Take over the project responsibilities yourself\n\n**Question 2:** You've been asked to take on additional work hours, but you're already at capacity. How would you prioritize your tasks and manage your workload?\n\nA) Focus on completing all existing tasks first\nB) Delegate tasks to colleagues or subordinates\nC) Ask your manager for more resources or support\nD) Turn down the additional work hours\n\n**Question 3:** You've made a mistake in a previous project, and it's now being scrutinized by stakeholders. How would you handle this situation?\n\nA) Blame someone else for the mistake\nB) Take full responsibility for the mistake and offer to correct it\nC) Downplay the severity of the mistake\nD) Try to justify or explain away the mistake\n\n**Question 4:** You've been working on a project for several months, and you're feeling burnt out. What would be the most effective way to take a break and recharge?\n\nA) Take a few days off work to relax and unwind\nB) Work extra hours to catch up on any missed tasks\nC) Delegate more tasks to others to take some pressure off\nD) Stay focused and try to push through the exhaustion\n\n**Question 5:** You've been asked to present your project findings to a large group of stakeholders. How would you prepare for this presentation?\n\nA) Spend hours rehearsing the presentation to ensure perfect delivery\nB) Focus on getting all the data correct, but don't worry too much about presentation style\nC) Practice the presentation with a colleague or friend to get feedback\nD) Try to wing it and see what happens\n\nPlease select an answer for each question, and I'll simulate a response based on your choices."
  }
}
